# Scale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..Scale Property
Transform Class See Also
---
The real number that represents the scale of the transformation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Scale { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Scale As Double
	Get
```

Visual C++
---
```text
public:
property double Scale {
	double get ();
}
```

# Remarks
When the transformation is conformal and can be decomposed as the product of a rigid-body motion, uniform scale and reflection, this property returns the scale value of the uniform scale transformation.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when this transformation is not conformal and the scale is undefined. |

# See Also
Transform Class
Autodesk.Revit.DB Namespace